---
kind: property
id: P:Autodesk.Revit.DB.UV.BasisU
source: html/dfcd6ba7-5ded-f104-5247-fbe733ae41d4.htm
---
# Autodesk.Revit.DB.UV.BasisU Property

The basis of the U axis.

## Syntax (C#)
```csharp
public static UV BasisU { get; }
```

## Remarks
The basis of the U axis is the vector (1,0), the unit vector on the U axis.